bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA8HVA.xml
                <register caption="CC-ADC Control and Status Register B" name="CADCSRB" offset="0xE5" size="1">
                    <bitfield caption="" mask="0x40" name="CADACIE"/>
                    <bitfield caption="Regular Current Interrupt Enable" mask="0x20" name="CADRCIE"/>
                    <bitfield caption="CAD Instantenous Current Interrupt Enable" mask="0x10" name="CADICIE"/>
                    <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x04" name="CADACIF"/>
                    <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x02" name="CADRCIF"/>
                    <bitfield caption="CC-ADC Instantaneous Current Interrupt Flag" mask="0x01" name="CADICIF"/>
                </register>
                <register caption="CC-ADC Instantaneous Current" name="CADIC" offset="0xE8" size="2" mask="0xFFFF"/>
                <register caption="ADC Accumulate Current" name="CADAC3" offset="0xE3" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="ADC Accumulate Current" name="CADAC2" offset="0xE2" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="ADC Accumulate Current" name="CADAC1" offset="0xE1" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="ADC Accumulate Current" name="CADAC0" offset="0xE0" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="CC-ADC Regular Current" name="CADRC" offset="0xE6" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
            <register-group caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
                <register caption="Regulator Operating Condition Register" name="ROCR" offset="0xC8" size="1"
                          ocd-rw="R">
                    <bitfield caption="ROC Status" mask="0x80" name="ROCS"/>
                    <bitfield caption="ROC Warning Interrupt Flag" mask="0x02" name="ROCWIF"/>
                    <bitfield caption="ROC Warning Interrupt Enable" mask="0x01" name="ROCWIE"/>
                </register>
            </register-group>
        </module>
    </modules>
</part-description-file>